package com.ssafy.be.common.Provider;

import org.springframework.stereotype.Component;

import java.util.Random;

@Component
public class NickNameProvider {
    public static final String[] prefix = {
            "밝은", "따뜻한", "감사한", "행복한", "기쁜", "즐거운", "상냥한", "친절한", "다정한",
            "부지런한", "성실한", "정직한", "깨끗한", "맑은", "순수한", "깔끔한", "똑똑한", "영리한",
            "총명한", "귀여운", "사랑스러운", "예쁜", "멋진", "훌륭한", "대단한", "놀라운", "믿음직한",
            "든든한", "용감한", "씩씩한", "당당한", "우아한", "고상한", "품위 있는", "자신감 있는",
            "당찬", "열정적인", "활기찬", "생기 있는", "명랑한", "쾌활한", "낙천적인", "긍정적인",
            "희망찬", "신선한", "상쾌한", "청결한", "단정한", "건강한", "튼튼한", "건장한", "강인한",
            "대담한", "진취적인", "도전적인", "혁신적인", "창의적인", "독창적인", "재능 있는", "유능한",
            "실력 있는", "노력하는", "성취하는", "이루는", "완성하는", "풍성한", "풍요로운", "넉넉한",
            "여유로운", "자애로운", "관대한", "너그러운", "화목한", "평화로운", "안정된", "원만한",
            "부드러운", "온화한", "자상한", "정겨운", "포근한", "아늑한", "편안한", "고요한", "차분한",
            "담담한", "침착한", "침묵한", "단아한", "점잖은", "온순한", "얌전한", "착한", "선한",
            "가벼운", "가난한", "가까운", "가늘고 긴", "가치 있는", "강한", "거대한", "건강한",
            "고급스러운", "고마운", "고요한", "공평한", "귀여운", "긍정적인", "깨끗한", "낮은", "너그러운",
            "넓은", "높은", "느린", "다양한", "달콤한", "단단한", "단순한", "답답한", "대단한", "더러운",
            "덥고 습한", "독특한", "둥근", "따뜻한", "똑똑한", "무거운", "밝은", "부드러운", "부족한",
            "불편한", "비싼", "사랑스러운", "새로운", "서두르는", "섬세한", "성실한", "시원한", "신선한",
            "아름다운", "약한", "어두운", "어려운"
    };
    public static final String[] suffix = {
            "꽃", "나무", "하늘", "구름", "별", "달", "태양", "무지개", "바다", "호수", "강",
            "폭포", "산", "숲", "정원", "공원", "책", "음악", "그림", "조각", "사진", "영화",
            "연극", "춤", "노래", "시", "편지", "일기", "선물", "보석", "향수", "비누", "촛불",
            "램프", "거울", "화분", "그릇", "컵", "숟가락", "포크", "나이프", "접시", "쟁반",
            "수건", "모자", "장갑", "스카프", "양말", "신발", "가방", "지갑", "열쇠", "자물쇠",
            "시계", "안경", "펜", "연필", "붓", "물감", "종이", "노트", "달력", "지도", "지구본",
            "망원경", "현미경", "카메라", "라디오", "텔레비전", "컴퓨터", "전화기", "스마트폰",
            "태블릿", "프린터", "스캐너", "복사기", "팩스", "계산기", "자", "나침반", "온도계",
            "저울", "모래시계", "퍼즐", "블록", "인형", "곰 인형", "로봇", "모형", "트로피",
            "메달", "상장", "증서", "수료증", "명함", "초대장", "엽서", "우표", "동전", "책상",
            "자동차", "강아지", "노트북", "사과", "구두", "병", "창문", "문", "소파", "가위",
            "우산", "꿀", "풍선", "병아리", "새", "꿈", "피아노", "축구공", "상자", "모래",
            "바람", "구슬", "나비", "풍경"
    };

    public String randomNickName(){
        StringBuilder sb = new StringBuilder();
        Random random = new Random();
        // 0부터 9999까지의 랜덤 숫자 생성
        int randomNumber = random.nextInt(10000);
        String nicknamePrefix = prefix[random.nextInt(prefix.length-1)];
        String nicknameSuffix = suffix[random.nextInt(suffix.length-1)];

        return  sb.append(nicknamePrefix).append(" ").append(nicknameSuffix).append(" ").append(randomNumber).toString();
    }

}
